import type { MarketingPlan } from "../type.js";

export const marketingPlan: MarketingPlan[] = [
  {
    id: "blind-box",
    name: "盲盒抽奖",
    description: "通过储值兑换抽奖券在线开启盲盒，并且支持获得图鉴和图鉴大奖，有效刺激会员消耗储值",
    triggeringCondition: "耗币数或耗票数对比往日下降时, 存票数上升时",
    example: `
      国庆抽盲盒，活动规则如下：
      - 活动期间可以用50彩票或者20代币兑换1张盲盒抽奖券
      - 盲盒中包含各式奖品与图鉴
      - 集齐图鉴可获取1000游戏币和国庆王称号
    `,
  },

  {
    id: "turntable",
    name: "转盘抽奖",
    description: "通过储值兑换抽奖券，会员可从奖池抽取奖励，所有会员共享奖池，有效刺激会员消耗储值",
    triggeringCondition: "耗币数或耗票数对比往日下降时，存票数下降时",
    example: `
      转盘抽大奖！最高可获小米电视1台！活动规则如下：
      - 活动期间可以用10代币/1000彩票兑换1张转盘抽奖券
      - 奖池中包含各式奖品
      - 一等奖为小米电视1台、二等奖为代币1000个、三等奖为500积分
    `
  },

  {
    id: "lottery-master",
    name: "彩票大师",
    description: "新增彩票大师级别体系，通过彩票机台耗币数与存票数单独计算成长值，并支持按存票数排行，有效刺激指定机台耗币量",
    triggeringCondition: "耗币数或存票数下降，且币单价下降时",
    example: `
      开启彩票天梯赛！人人都做彩票大师
      活动规则如下：
      - 活动期间在指定彩票机台进行耗币与存票，升级彩票大师级别
      - 活动期间个人排行榜前10名，全国个人榜前20名，彩票大师榜前50名均可获得奖励
      - 一等奖为苹果手机1台、二等奖为代币9990个、三等奖为500娃娃
    `
  },

  {
    id: "holiday-check-in-card",
    name: "节日签到卡",
    description: "低币值大背景下，场地在节日期间活动套餐的币量很大，很多顾客花不完，通过节日签到卡，可以让大币量的客户，节日期间多到店促进耗币，从而为下一个活动节日蓄力",
    triggeringCondition: "准备到来法定节假日、暑假、寒假，并且耗币数，活跃会员下降时",
    example: `
      活动名称： 建议7个文字内，例如：国庆签到卡，圣诞签到卡，春节签到卡
      活动时间：活动时间内购买套餐赠送签到卡
      每个会员最多可得签到卡数量：默认1张，也可设置多买多送
      打卡时间：打卡时间内才可以打卡，例如国庆前可以先买套餐赠送签到卡，10.1 才能打卡
      打卡定义：用户只有先完成其中一种才可以在小程序上领币
      赠送币数：仅支持代币或金币，不支持其他储值
      活动规则：可根据设定自动生成规则
    `
  },

  {
    id: "lottery-competition",
    name: "彩票竞技赛",
    description: "门店可创建彩票竞技赛，玩家游玩指定彩票机台即可参与活动，在规定活动时间范围内，玩家从彩票机台获取的彩票数越多，排名就越高。活动结束后，玩家可根据活动结束时的排名名次获取对应的名次奖励，期间无需额外支付任何储值，其本质就是一个冲榜活动。",
    triggeringCondition: "耗币数，活跃会员下降时",
    example: `
      活动名称：例如：最快存50000票玩家，赢得800币!
      开始时间：设置活动开始时间，到点自动开始大赛，两活动之间开始时间间隔需大于1小时。
      适用机台：读取所有机台类型为彩票机
      参与条件：需会员在卡头投币多少数量才能参与活动，例如：设置数量为10，则会员需在卡头上刷卡、实物币等方式投币数量达到10，参与成功会点亮氛围大屏幕对应的机台P位。
      报名时限：参与活动报名倒计时，会显示在氛围大屏幕，若倒计时结束没有会员达成“参与条件”，活动自动结束。
      获胜条件：活动获取第一名的条件，一旦达到即结束活动，若无人达成将持续保持活动进行中。例如：设置累计存票>=1000，会员累计存票或出票达到1000，即会结束比赛。
    `
  },

  {
    id: "flash-sale-activity",
    name: "秒杀活动",
    description: "配置秒杀活动与秒杀商品，活动时间内支持限制每个会员可购N个秒杀商品",
    triggeringCondition: "消费人数或者活跃人数下降时",
  },

  {
    id: "full-discount",
    name: "满减活动",
    description: "配置满减促销，购买指定商品到达一定金额后即可享受现金优惠",
    triggeringCondition: "营业额下降时",
  },

  {
    id: "member-discount",
    name: "会员折扣",
    description: "会员购买指定商品可享受折扣价，提升营业额与入会量",
    triggeringCondition: "营业额下降并且新会员数下降时",
  },

  {
    id: "member-special-price",
    name: "会员特价",
    description: "会员购买指定商品可享受会员特价，提升营业额与入会量",
    triggeringCondition: "消费人数或者活跃人数下降、或新会员数下降时",
  },

  {
    id: "giving-coupons",
    name: "赠币券",
    description: "会员购买指定商品，可获得赠币券提高营业额和订单量",
    triggeringCondition: "营业额或者订单数下降时",
  },

  {
    id: "coupons",
    name: "优惠券",
    description: "通过派发优惠券，刺激顾客消费并且提高指定商品的营业额与订单量",
    triggeringCondition: "订单数或者营业额下降，且新会员数下降时",
  },

  {
    id: "exchange-discount-coupons",
    name: "兑换折扣券",
    description: "通过派发兑换折扣券券，刺激顾客进行兑换，提高耗票或者消耗其他储值",
    triggeringCondition: "耗票数对比往日下降时，存票数上升时",
  }
];